<!DOCTYPE html>
<html lang="ru">
<head>
  <title>ESPShell : I2C</title>
  <link rel="stylesheet" href="espshell.css">
</head>
<body>
<p align="center"><a href="index.html"><img src="i/espshell_logo.jpg" alt="ESPShell для Arduino :: I2C" width="70%" height="70%" /></a></p>

<ul>
  <li><a href="#iic">Шина I2C на ESP32</a></li>
  <li><a href="#up">Инициализация и завершение работы I2C</a></li>
  <li><a href="#scan">Сканирование устройств</a></li>
  <li><a href="#help">Отправка и приём данных</a></li>
  <li><a href="#examples">Примеры: доступ к RTC и EEPROM</a></li>
</ul>

<h2 id="iic"><a href="#top">&#8686;</a>ШИНА I<sup>2</sup>C</h2>

<p>
Команды I<sup>2</sup>C позволяют настроить интерфейс I<sup>2</sup>C на произвольных пинах, просканировать шину на наличие устройств и выполнять операции чтения/записи с выбранными устройствами. Это упрощает работу с новыми I<sup>2</sup>C-устройствами, проверку их доступности и разработку библиотек: можно отправлять тестовые последовательности в устройство без перекомпиляции всего скетча.
</p>

<p>
ESP32 имеет два аппаратных интерфейса I<sup>2</sup>C. Назначение пинов по умолчанию зависит от модели: например, у чипа ESP32-WROOM-32D пины для I<sup>2</sup>C0 — это 21 (SDA) и 22 (SCL).
</p>

<h2 id="up"><a href="#top">&#8686;</a>I<sup>2</sup>C: НАСТРОЙКА, ЧТЕНИЕ, ЗАПИСЬ И СКАНИРОВАНИЕ</h2>

<p>
Для настройки или доступа к интерфейсу I<sup>2</sup>C используется команда "<b>iic</b> <i>I2C_NUM</i>", где <i>I2C_NUM</i> — номер интерфейса. После выполнения команды приглашение ESPShell сменится на "<b>esp32-i2c0&gt;</b>", что означает переход в режим конфигурации I<sup>2</sup>C. Для выхода из этого режима используйте команду "exit" или нажмите <kbd>Ctrl+Z</kbd>.
</p>

<p>
В режиме конфигурации I<sup>2</sup>C доступны 6 команд:
(Также можно использовать команды из основного дерева, например, "pin" доступна и внутри "esp32-i2c>")
</p>

<pre>
  esp32#>iic 0
  esp32-i2c>?
  % Enter "? command" to get details about the command.
  % List of available commands:
  %
  % "?"        : Show the list of available commands
  % "up"       : Initialize interface (pins and speed)
  % "clock"    : Set clock speed
  % "read"     : Read data from a device
  % "down"     : Shut down I<sup>2</sup>C interface
  % "scan"     : Scan I<sup>2</sup>C bus
  % "write"    : Send bytes to the device
  % "exit"     : Exit
  esp32-i2c>
</pre>

<p>
Все команды (кроме "<b>up</b>") требуют предварительной инициализации интерфейса. Для этого используется команда "<b>up</b>", принимающая три аргумента: пин SDA, пин SCL и частоту тактирования (в Гц).
</p>

<p>
Например, чтобы инициализировать I<sup>2</sup>C0 с частотой 100 кГц на пинах 21 (SDA) и 22 (SCL):
</p>

<pre>
  esp32#>iic 0
  esp32-i2c>up 21 22 100000
</pre>

<p>
После инициализации шины можно выполнять команды чтения, записи и сканирования. Рекомендуется приостановить выполнение основного скетча, чтобы избежать конфликтов (см. команды "suspend" и "resume"). Для завершения работы шины используйте команду "<b>down</b>".
</p>

<p>
Просканируем шину I<sup>2</sup>C. В этом примере к I<sup>2</sup>C0 подключены два устройства:
</p>

<pre>
  esp32#>iic 0
  esp32-i2c>up 21 22 100000
  esp32-i2c>scan
  % Scanning I<sup>2</sup>C bus 0...
  % Device found at address 57
  % Device found at address 68
  % 2 devices found
  esp32-i2c>
</pre>

<p>
Эти два устройства — часы реального времени DS3231 и EEPROM на 64К, размещённые на одной плате и подключённые к пинам 21 и 22.
</p>

<p>
Теперь пообщаемся с чипом часов и прочитаем текущее время. Мы воспользуемся командами "write" и "read", чтобы запросить и получить данные:
</p>

<pre>
  esp32-i2c>write 0x68 0
  % Sending 1 byte over I<sup>2</sup>C0
  esp32-i2c>read 0x68 7
  % I<sup>2</sup>C0 received 7 bytes:
  24 25 22 03 18 09 24                < -- hexadecimal values
</pre>

<p>
Принятые байты представляют текущее время: 22:25:24, третий день недели, 18 сентября 2024. Имея даташит на устройство, можно легко расшифровать и отправлять собственные команды — полезно при разработке библиотеки для нового I<sup>2</sup>C-устройства.
</p>

<p>
Для удобства необязательно использовать префикс "0x": вместо "0x98" можно просто ввести "98", ввод трактуется как шестнадцатеричный.
</p>

<pre>
    esp32-i2c>write 0x68 0x11 0x12 0x13
</pre>
<p>эквивалентно</p>
<pre>
    esp32-i2c>write 0x68 11 12 13
</pre>

<h2 id="examples"><a href="#top">&#8686;</a>Пример: чтение из EEPROM (адрес 57)</h2>

<pre>
  esp32#>iic 0
  esp32-i2c>up 21 22 100000
  esp32-i2c>scan
  % Scanning I<sup>2</sup>C bus 0...
  % Device found at address 57
  % Device found at address 68
  % 2 devices found
  esp32-i2c>write 0x57 0 0
  % Sending 2 bytes over I<sup>2</sup>C0
  esp32-i2c>read 57 56
  % I<sup>2</sup>C0 received 56 bytes:
        0  1  2  3   4  5  6  7   8  9  A  B   C  D  E  F   |0123456789ABCDEF
  ----------------------------------------------------------+----------------
  0000: de ad be ef  04 05 06 07  08 09 0a 0b  0c 0d 0e 0f  |............... 
  0010: 10 22 33 44  55 66 77 88  99 aa bb cc  1c 1d 1e 1f  |."3DUfw.........
  0020: 20 21 22 23  24 25 26 27  28 29 2a 2b  2c 2d 2e 2f  | !"#$%&'()*+,-./
  0030: 30 31 32 33  34 35 36 37                            |01234567
  esp32-i2c0>
</pre>

<p>
ПРИМЕЧАНИЕ: если размер запрошенных данных превышает 16 байт, вывод форматируется, как показано выше.
</p>

<p>
Команда "<b>clock</b>" используется для изменения частоты I<sup>2</sup>C. Например, "clock 150000" установит частоту 150 кГц. Максимально поддерживаемое значение — 1 МГц.
</p>

<p>
Команда "<b>down</b>" завершает работу интерфейса I<sup>2</sup>C.
</p>

<p>
Для выхода из режима конфигурации I<sup>2</sup>C используйте команду "exit" или <kbd>Ctrl+Z</kbd>.
</p>

</body>
</html>
