<!DOCTYPE html>
<html lang="en">
<head>
  <title>ESPShell : I2C</title>
  <link rel="stylesheet" href="espshell.css">
  <meta charset="UTF-8">
</head>
<body>
<p align="center"><a href="index.html"><img src="i/espshell_logo.jpg" alt="ESPShell for Arduino :: I2C" width="70%" height="70%" /></a></p>
<h3 align=center><a href="I2C.ru.html">[ –ù–∞ —Ä—É—Å—Å–∫–æ–º ]</a>&nbsp;&harr;&nbsp;<a href="I2C.html">[ English ]</a></h3>
<ul>
  <li><a href="#iic">I2C bus on ESP32</a></li>
  <li><a href="#up">Setting up & shutting down an I2C bus</a></li>
  <li><a href="#scan">Scanning for devices</a></li>
  <li><a href="#help">Sending and receiving data</a></li>
  <li><a href="#examples">Examples: RTC & EEPROM access</a></li>
</ul>

<h2 id="iic"><a href="#top">&#8686;</a>I<sup>2</sup>C BUS</h2>

<p>
I<sup>2</sup>C commands allow you to configure an I<sup>2</sup>C interface on arbitrary pins, scan the I<sup>2</sup>C bus for devices, and perform read/write operations on selected devices. This simplifies working with new I<sup>2</sup>C devices, checking whether a device is responsive, and developing libraries: you can send test sequences to a device without recompiling the entire sketch.
</p>

<p>
The ESP32 has two hardware I<sup>2</sup>C interfaces. Default pin assignments vary by model: for example, the ESP32-WROOM-32D chip uses pins 21 (SDA) and 22 (SCL) for I<sup>2</sup>C0.
</p>

<h2 id="up"><a href="#top">&#8686;</a>I<sup>2</sup>C: CONFIGURING, READING, WRITING AND SCANNING</h2>

<p>
To configure or access an I<sup>2</sup>C interface, use the "<b>iic</b> <i>I2C_NUM</i>" command, where <i>I2C_NUM</i> is the number of the I<sup>2</sup>C interface to configure. After executing the command, the ESPShell prompt changes to "<b>esp32-i2c0&gt;</b>", indicating that you're now in I<sup>2</sup>C configuration mode. Use the "exit" command or press <kbd>Ctrl+Z</kbd> to leave this mode.
</p>

<p>
There are 6 commands available in I<sup>2</sup>C configuration mode:
(You can also use commands from the main tree ó for example, the "pin" command is available inside the "esp32-i2c>" tree.)
</p>

<pre>
  esp32#>iic 0
  esp32-i2c>?
  % Enter "? command" to get details about the command.
  % List of available commands:
  %
  % "?"        : Show the list of available commands
  % "up"       : Initialize interface (pins and speed)
  % "clock"    : Set clock speed
  % "read"     : Read data from a device
  % "down"     : Shut down I<sup>2</sup>C interface
  % "scan"     : Scan I<sup>2</sup>C bus
  % "write"    : Send bytes to the device
  % "exit"     : Exit
  esp32-i2c>
</pre>

<p>
All of these commands (except "<b>up</b>") require the I<sup>2</sup>C interface to be initialized first. To do this, use the "<b>up</b>" command. It takes three arguments: the SDA pin, the SCL pin, and the clock rate (in Hz).
</p>

<p>
For example, to initialize I<sup>2</sup>C0 with a 100 kHz clock on pins 21 (SDA) and 22 (SCL):
</p>

<pre>
  esp32#>iic 0
  esp32-i2c>up 21 22 100000
</pre>

<p>
Once the bus is initialized, you can perform read, write, and scan operations. It's a good idea to suspend the main sketch to avoid interference with your I<sup>2</sup>C access (see the global "suspend" and "resume" commands). To shut down the bus, use the "<b>down</b>" command.
</p>

<p>
Let's scan the I<sup>2</sup>C bus. In this example, two devices are connected to I<sup>2</sup>C0:
</p>

<pre>
  esp32#>iic 0
  esp32-i2c>up 21 22 100000
  esp32-i2c>scan
  % Scanning I<sup>2</sup>C bus 0...
  % Device found at address 57
  % Device found at address 68
  % 2 devices found
  esp32-i2c>
</pre>

<p>
These two devices are a DS3231 real-time clock and a 64K EEPROM, both located on the same breakout board connected to pins 21 and 22.
</p>

<p>
Now let's communicate with the clock chip to read the current time. We'll use the "write" command to request the time and "read" to get the response:
</p>

<pre>
  esp32-i2c>write 0x68 0
  % Sending 1 byte over I<sup>2</sup>C0
  esp32-i2c>read 0x68 7
  % I<sup>2</sup>C0 received 7 bytes:
  24 25 22 03 18 09 24                < -- hexadecimal values
</pre>

<p>
The received bytes represent the current time: 22:25:24, third day of the week, 18th of September 2024. With the device's datasheet, you can interpret and communicate directly with it ó helpful when developing a new I<sup>2</sup>C library.
</p>

<p>
For convenience, hexadecimal input does not require the "0x" prefix: you can enter "98" instead of "0x98", and it will be interpreted as hexadecimal.
</p>

<pre>
    esp32-i2c>write 0x68 0x11 0x12 0x13
</pre>
<p>is the same as:</p>
<pre>
    esp32-i2c>write 0x68 11 12 13
</pre>

<h2 id="examples"><a href="#top">&#8686;</a>Example: Reading from EEPROM (address 57)</h2>

<pre>
  esp32#>iic 0
  esp32-i2c>up 21 22 100000
  esp32-i2c>scan
  % Scanning I<sup>2</sup>C bus 0...
  % Device found at address 57
  % Device found at address 68
  % 2 devices found
  esp32-i2c>write 0x57 0 0
  % Sending 2 bytes over I<sup>2</sup>C0
  esp32-i2c>read 57 56
  % I<sup>2</sup>C0 received 56 bytes:
        0  1  2  3   4  5  6  7   8  9  A  B   C  D  E  F   |0123456789ABCDEF
  ----------------------------------------------------------+----------------
  0000: de ad be ef  04 05 06 07  08 09 0a 0b  0c 0d 0e 0f  |............... 
  0010: 10 22 33 44  55 66 77 88  99 aa bb cc  1c 1d 1e 1f  |."3DUfw.........
  0020: 20 21 22 23  24 25 26 27  28 29 2a 2b  2c 2d 2e 2f  | !"#$%&'()*+,-./
  0030: 30 31 32 33  34 35 36 37                            |01234567
  esp32-i2c0>
</pre>

<p>
NOTE: If the requested data size exceeds 16 bytes, the output is formatted as shown above.
</p>

<p>
Use the "<b>clock</b>" command to change the I<sup>2</sup>C clock speed. For example, "clock 150000" sets the speed to 150 kHz. The maximum supported value is 1 MHz.
</p>

<p>
The "<b>down</b>" command shuts down the I<sup>2</sup>C interface.
</p>

<p>
Use the "exit" command or press <kbd>Ctrl+Z</kbd> to leave I<sup>2</sup>C configuration mode.
</p>

</body>
</html>
